汉语共有四个声调，即：  阴平，ā 阳平，á 上声，ǎ 去声，à  
从声调分，也可分四类： 
（1）阴平类。如：张 孙 丁 薛 温 奚 沙 柯 刁 方 金 衣 安 包 申 周 江 宫 高 郭 曾 甘 朱 崔 
（2）阳平类。如：刘 陈 王 杨 石 余 冯 于 吴 邢 门 柴 姚 胡 徐 袁 常 曹 乔 彭 黄 韩 裴 齐  
（3）上声类。如：李 董 孔 古 史 左 武 许 贾 巩 郝 吕 米 马 蒋 纪 阚 柳 鲁 沈 伍 展 海 冷 
（4）去声类。如：赵 陆 邓 万 宋 杜 步 孟 夏 毕 贺 廖 慕 郑 尚 付 盖 范 聂 费 谢 魏 贝 叶    


单名只有一个字每个姓氏都有四种声调组合形式。

（1）阴平类
A、阴-阴型。例如：张 飞 ,江 东
B、阴-阳型。例如：丁 玲 ,丘 弘 
C、阴-上型。例如：包 拯 ,干 宝 
D、阴-去型。例如：崔 岳 ,曾 震 
阴平类的姓氏具有较强的组合能力。D类阴一去型稍微逊色
（2）阳平类。  
A、阳-阴型。例如：于 谦, 刘 苍 ,毛 享 ,曹 丕, 余 熙, 田 间 
B、阳-阳型。例如：石 雄, 岑 彭 ,吴 良 ,何 群, 服 虔 ,杨 亭 
C、阳-上型。例如：文 丑 ,冯 允 ,黄 侃 ,程 鼎 ,卢 勇, 蓝 理 
D、阳-去型。例如：韩 愈 ,佟 岱 ,侯 翼,陈 毅 ,袁 镇 ,雷 度   
A、C、D三种是理想的组合 
（3）上声类。
A、上-阴型。例如：古 心 ,左 思 ,冷 曦, 武 英, 马 超, 耿 光 
B、上-阳型。例如：李 白, 葛 洪, 管 宁, 阚 泽 ,伍 乔, 褚 渊 
C、上-上型。例如：孔 武 ,史 谨, 柳 永, 展 喜, 董 朴, 柏 古 
D、上-上型。例如：贾 谊 ,鲁 肃 ,吕 布 ,许 慎, 海 瑞 ,沈 固  
 上述四种类型中，A、B、D三种是理想的组合
 
（4）去声类。  
A、去-阴型。例如：岳 飞 宋 江 孟 轲 段 规 范 增 卫 青 
B、去-阳型。例如：贺 龙 夏 霖 万 言 赵 云 郑 玄 陆 游 
C、去-上型。例如：杜 甫 尚 野 项 羽 叶 挺 邓 鲁 路 楷 
D、去-去型。例如：贝 泰 季 布 郁 浩 廖 立 杜 厚 魏 照   
上述四种类型中，A、B、C三种是理想的组合，

每个姓氏均有16种声调组合形式。
（1）阴平类。 
A、阴-阴-阴型。例如：周嘉缃 江东之 汪叔詹 孙希朱 殷开山 郗僧施 
B、阴-阴-阳型。例如：师安石 郭松林 舒知雄 周恩来 方秋白 关开培 
C、阴-阴-上型。例如：汤光启 孙星衍 丁飞举 方千里 诸匡鼎 朱光普 
D、阴-阴-去型。例如：詹天佑 孙枝蔚 乌斯道 崔公度 薛天定 章金牧 
E、阴-阳-阴型。例如：曾原一 施尔宽 朱元璋 丘禾嘉 苏奎章 丁文江 
F、阴-阳-阳型。例如：章学诚 詹尔达 甘惟寅 高迎祥 温庭筠 钟人杰 
G、阴-阳-上型。例如：勾文鼎 申无宇 姜柔远 段闻礼 张吾瑾 丘逢甲 
H、阴-阳-去型。例如：崔如岳 诸弘道 戚人镜 商承祚 臧尔令 张从正
 I、阴-上-阴型。例如：康乃心 屈可伸 钟子期 司九经 周汝登 萧省身 
J、阴-上-上型。例如：朱隐老 周铁虎 孙子昶 宫守礼 庄有可 萧永藻 
K、阴-上-阳型。例如：邹守愚 渊有为 朱买臣 章炳麟 张友渔 康伟然 
L、阴-上-去型。例如：萧子岳 朱百度 支可大 张我正 江有诰 方以智 
M、阴-去-阴型。例如：张若虚 邹汉章 曾万中 甘梦英 龚自珍 章士钊 
N、阴-去-阳型。例如：丘必明 雍乐成 柯梦得 申湛然 甄立言 苏光熊
O、阴-去-上型。例如：包万有 湛若水 安致远 戈尚友 温大雅 欧敬竹 
P、阴-去-去型。例如：郭沫若 薛万备 丁善庆 刁士敬 汪道贯 辛庆忌   
比较理想的是E、H、J、K、M、N八种。它们共同的特点是声调富于变化，读起来顺口，听起来悦耳。
内中尤以E、J、N三种为佳。

（2）阳平类。 
A、阳-阳-阴型。例如：黄庭坚 卓尔康 来集之 石达开 陈潭秋 吉鸿昌
 B、阳-阳-阳型。例如：王得臣 皮龙荣 余时言 房玄龄 徐文华 何国材 
C、阳-阳-上型。例如：狄明远 洪岩虎 胡承珙 韦云起 原伯鲁 唐庭楷 
D、阳-阳-去型。例如：陈独秀 刑云路 仇时济 徐霞客 文廷式 倪文蔚 
E、阳-阴-阴类。例如：裴松之 房知温 林公一 祁班孙 胡山宾 袁天纲 
F、阳-阴-阳类。例如：王安石 屠湘灵 雷光霆 蒲松龄 陈彭年 钱三强 
G、阳-阴-上类。例如：隆光祖 丌之伟 颜师古 程千里 刘知几 白日可 
H、阳-阴-去类。例如：石天柱 侯方域 黄遵宪 白居易 王之焕 承天秀 
J、阳-上-阴类。例如：晃补之 成始终 黄孔昭 徐海东 刘野夫 程咬金 
K、阳-上-阳类。例如：曹雪芹 秦九韶 田有年 杨虎城 冯子材 洪起元 
L、阳-上-上类。例如：王子武 佟养甲 吴可几 和有礼 杨守址 何挺颖 
M、阳-上-去类。例如：全祖望 毛羽健 何有志 曹勇义 梅鼎祚 陈友定 
N、阳-去-阴类。例如：龙太初 王念孙 皮日休 罗贯中 刘志丹 闻一多 
O、阳-去-阳类。例如：卢照邻 秦再雄 童日铭 陈少涛 谭嗣同 洪秀全 
P、阳-去-上类。例如：韦岳子 姚梦午 邢抱朴 席上锦 袁尚统 杨靖宇 
Q、阳-去-去类。例如：俞正燮 余克济 吴必大 韩仲孝 唐际盛 时立爱   
上述16种组合形式中，最佳的组合是F、G、H、J、K、N、O、P八种。
其次是A、D、C、E、M五种。 
（3）上声类。  
A、上-上-阴类。例如：许乃钊 伍典章 吕景初 李左车 马孔英 掌禹锡 
B、上-上-阳类。例如：孔颖达 沈友琴 阮美成 浦起龙 耿守直 沈野云 
C、上-上-上类。例如：史可法 李以笃 许乃普 汝可起 葛守礼 史显祖 
D、上-上-去类。例如：孔广翼 沈甲秀 许法慎 李秉彝 贾履上 蒋羽化 
E、上-阴-阴类。例如：武三思 祖冲一 卜天生 马师班 展庄叔 耿昌期 
F、上-阴-阳类。例如：虎坤元 马之纯 贾思勰 沈冰壶 武攸宁 尹耕云 
G、上-阴-上类。例如：左光斗 李商陷 郝天挺 李公朴 沈君理 冼星海 
H、上-阴-去类。例如：吕公弼 左匡政 李三畏 种师道 葛师旦 孔思晦 
J、上-阳-阴类。 例如：柳同春 葛云飞 李时珍 党怀英 孔云章 龚霆松 
K、上-阳-阳类。例如：储良材 种云龙 柳玄达 李行言 楚执柔 马连良 
L、上-阳-上类。例如：古其品 史维堡 猛如虎 许鸣运 党崇雅 沈明远 
M、上-阳-去类。例如：伍维寿 祖良壁 郝奇遇 马怀素 莉宏毅 李玄霸 
N、上-去-阴类。例如：冷寿光 吕步舒 李奉先 米万钟 褚少孙 苟日新 
O、上-去-阳类。例如：古道行 卜大同 庾自直 李自成 祖秀实 耿静如 
P、上-去-上类。例如：柏立本 史光斗 伍正己 董必武 许赤虎 葛万里 
Q、上-去-去类。例如：孔尚任 耿定力 李道泰 沈用济 钮树玉 贾汉复   

上述16种组合形式中，E、F、G、H、J、M、N、O、P九种理想的组合。
K和L也可采用，但效果显然要逊色。
（4）去声类。 
A、去-去-阴型。例如：杜幼安 路振飞 郑介夫 冒致中 范仲淹 扈再兴
 B、去-去-阳型。例如：孟浩然 豆代田 邵晋涵 祝万龄 卞立言 项梦原 
C、去-去-上型。例如：夏尚朴 鲍作雨 郑至果 孟化鲤 叶孟鼎 杜易简 
D、去-去-去型。例如：宋聚业 富大用 毕再遇 万正色 霍去病 范日进 
E、去-阴-阴型。例如：靳东发 沐天波 夏金标 赵冬曦 谢东山 杜叔高 
F、去-阴-阳型。例如：骆宾王 郁松年 万斯同 桂中行 贡修龄 冀邦直 
G、去-阴-上型。例如：大公鼎 叶方蔼 赵先雅 郑思永 缪钟理 蔡方炳 
H、去-阴-去型。例如：段公路 贡师道 赵匡胤 魏昭亮 赖天赋 谢三秀 
J. 去-阳-阴型。例如：邵伯温 范王孙 夏执中 廖莹中 兵伯川 郑成功 
K、去-阳-阳型。例如：慎从吉 但存学 祝弘奇 盖文达 夏时行 贯去石 
L、去-阳-上型。例如：杜鹏举 费扬古 郑元斗 霍元甲 邵文炳 顾炎武 
M、去-阳-去型。例如：单雄信 范成大 谢灵运 杜如晦 尉长命 解一贯 
N、去-上-阴型。例如：陆九渊 郑朴翁 宋景诗 恽本初 慰古真 赵卯发 
O、去-上-阳型。例如：杜审言 顾野王 蔡紫琼 宋汝为 邓演达 向警予 
P、去-上-上型。例如：祝可久 范祖禹 项守礼 尚可喜 郑以伟 毕祖朽 
Q、去-上-去型。例如：晏几道 厉汝进 傅启让 抱老寿 叶永秀 项笃寿   
上述16种组合形式中，E、F、G、H、J、L、M、N、O、Q十种系最佳组合。
